In [1]:
## dates and time series in pandas

In [2]:
import pandas as pd

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [6]:
## time column is a string

In [8]:
ufo['Time']= pd.to_datetime(ufo.Time)

In [9]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [12]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [14]:
ufo.Time.dt.hour.head()

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: int64

In [16]:
ufo.Time.dt.weekday_name.head()

0     Sunday
1     Monday
2     Sunday
3     Monday
4    Tuesday
Name: Time, dtype: object

In [18]:
ts = pd.to_datetime('1/1/1990')

In [20]:
ufo.loc[ufo.Time >= ts, :].head()

             City Colors Reported Shape Reported State                Time
6257  Minneapolis             NaN            NaN    MN 1990-01-01 00:00:00
6258      no data             NaN            NaN    NV 1990-01-01 23:00:00
6259  Barkhamsted             NaN            NaN    CT 1990-01-03 20:00:00
6260  New Orleans             NaN           DISK    LA 1990-01-06 22:00:00
6261       Sutton             NaN        VARIOUS    AK 1990-01-07 09:00:00

In [21]:
## doing math with time

In [22]:
ufo.Time.max() - ufo.Time.min()

Timedelta('25781 days 01:59:00')